app/controllers/admin/categories_controller.rb

    def create
        @category = Admin::Category.new(category_params)
        respond_with @category, location: @category.save ? admin_categories_path : new_admin_category_path(@category)
---
INSERT INTO `admin_categories` (`name`, `created_at`, `updated_at`) VALUES ('Demanda Padrão', '2015-05-05 02:55:06.892274', '2015-05-05 02:55:06.892274')

    def update
        respond_with @category, location: @category.update(category_params) ? admin_categories_path : edit_admin_category_path(@category)
---
UPDATE `admin_categories` SET `name` = 'Demanda Padrão 2', `updated_at` = '2015-05-05 03:00:09.776675' WHERE `admin_categories`.`id` = 1

    def destroy
        respond_with @category, location: admin_categories_path if @category.destroy
---
DELETE FROM `admin_categories` WHERE `admin_categories`.`id` = 2