app/controllers/admin/customers_controller.rb

    def create
        @customer = Admin::Customer.new(customer_params)
        respond_with @customer, location: @customer.save ? admin_customers_path : new_admin_customer_path(@customer)
---
INSERT INTO `admin_customers` (`name`, `responsible`, `active`, `hours`, `phone1`, `phone2`, `address`, `created_at`, `updated_at`) VALUES ('Hospital Monte Sinai', 'Carlos', 1, 80.0, '(32)3216-0921', '', '', '2015-05-05 23:44:15.501823', '2015-05-05 23:44:15.501823')

    def update
        respond_with @customer, location: @customer.update(customer_params) ? admin_customers_path : edit_admin_customer_path(@customer)
---
UPDATE `admin_customers` SET `responsible` = 'Carlos B.', `active` = 0, `updated_at` = '2015-05-05 23:45:05.771027' WHERE `admin_customers`.`id` = 1

    def destroy
        respond_with @customer, location: admin_customers_path if @customer.destroy
---
DELETE FROM `admin_customers` WHERE `admin_customers`.`id` = 2