app/controllers/admin/employees_controller.rb

    def create
        @employee = Admin::Employee.new(employee_params)
        respond_with @employee, location: @employee.save ? admin_employees_path : new_admin_employee_path(@employee)
---
INSERT INTO `admin_employees` (`name`, `registration`, `grupo_id`, `roles_mask`, `post`, `salary`, `created_at`, `updated_at`) VALUES ('Marco', 43256, 1, 2, 'Desenvolvedor Web', 2345.09, '2015-05-08 23:03:58.773226', '2015-05-08 23:03:58.773226')

    def update
        respond_with @employee, location: @employee.update(employee_params) ? admin_employees_path : edit_admin_employee_path(@employee)
---
UPDATE `admin_employees` SET `salary` = 2395.09, `updated_at` = '2015-05-08 23:07:21.323653' WHERE `admin_employees`.`id` = 1

    def destroy
        respond_with @employee, location: admin_employees_path if @employee.destroy
---
DELETE FROM `admin_employees` WHERE `admin_employees`.`id` = 2