app/controllers/admin/grupos_controller.rb

INSERT INTO `admin_grupos` (`nome`, `custo_total`, `created_at`, `updated_at`) VALUES ('AD', 200.0, '2015-04-15 00:32:28.285176', '2015-04-15 00:32:28.285176')
---
  def create
    @grupo = Admin::Grupo.new(grupo_params)
    respond_with @grupo, location: @grupo.save ? admin_grupos_path : new_admin_grupo_path(@grupo)

UPDATE `admin_grupos` SET `custo_total` = 250.0, `updated_at` = '2015-04-15 00:34:37.897079' WHERE `admin_grupos`.`id` = 1
---
  def update
    respond_with @grupo, location: @grupo.update(grupo_params) ? admin_grupos_path : edit_admin_grupo_path(@grupo)

DELETE FROM `admin_grupos` WHERE `admin_grupos`.`id` = 2
---
  def destroy
    respond_with @grupo, location: admin_grupos_path if @grupo.destroy