app/controllers/admin/usuarios_controller.rb

    def edit
        @resource = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1

    def destroy
        @user = User.find(params[:id])
        respond_to do |format|
            if @user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1