app/controllers/admin/work_types_controller.rb

SELECT id, name FROM `admin_work_types`
---
    def index
        @work_types = Admin::WorkType.select('id, name').all

INSERT INTO `admin_work_types` (`name`, `created_at`, `updated_at`) VALUES ('Tipo 1', '2015-05-12 23:13:00.346340', '2015-05-12 23:13:00.346340')
---
    def create
        @work_type = Admin::WorkType.new(work_type_params)
        respond_with @work_type, location: @work_type.save ? admin_work_types_path : new_admin_work_type_path(@work_type)

UPDATE `admin_work_types` SET `name` = 'Tipo 1c', `updated_at` = '2015-05-12 23:13:08.444882' WHERE `admin_work_types`.`id` = 1
---
    def update
        respond_with @work_type, location: @work_type.update(work_type_params) ? admin_work_types_path : edit_admin_work_type_path(@work_type)

SELECT  `admin_work_types`.* FROM `admin_work_types` WHERE `admin_work_types`.`id` = 1 LIMIT 1
---
    def set_work_type
        @work_type = Admin::WorkType.find(params[:id])