app/controllers/registrations_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `email` = 'guilhermecortes@gmail.com', `encrypted_password` = '$2a$10$RJAbl42hPQHrOHk9qEUtE./4kWtjgqMRVMAt4WnUm9X.9DK.L95XS', `updated_at` = '2015-04-01 02:18:01.096301' WHERE `users`.`id` = 1
---
	def update
		account_update_params = devise_parameter_sanitizer.sanitize(:account_update)

		# required for settings form to submit when password is left blank
		if account_update_params[:password].blank?
			account_update_params.delete("password")
			account_update_params.delete("password_confirmation")
		end

		@user = User.find(params[:user]['id'])

		if @user.update_attributes(account_update_params)